#+TITLE: TEST SCIMAX
#+AUTHOR: TL
#+DATE: <2023-01-22 dim.>



* configuration 

#+BEGIN_SRC emacs-lisp
(require 'scimax-jupyter)
#+END_SRC

#+RESULTS:
: scimax-jupyter


#+BEGIN_SRC emacs-lisp :results pp
org-babel-default-header-args:jupyter-python
#+END_SRC

#+RESULTS:
#+begin_example
((:results . "both")
 (:session . "jupyter-python")
 (:kernel . "python3")
 (:pandoc . "t")
 (:exports . "both")
 (:cache . "no")
 (:noweb . "no")
 (:hlines . "no")
 (:tangle . "no")
 (:eval . "never-export"))
#+end_example


** buffer specific kernels

#+PROPERTY: header-args:jupyter-python  :session jupyter-python-65b4bbc0ce13d4fe37ea917f95dfdd2e

#+BEGIN_SRC emacs-lisp
(scimax-jupyter-advise)
#+END_SRC

#+RESULTS:


** results seemed to be broken 

#+BEGIN_SRC jupyter-python
for i in range(3):
    print(i)
#+END_SRC
